{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,64,1],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"conv1d_Conv1D1","class_name":"Conv1D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8],"strides":[2],"padding":"same","dilation_rate":[1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU1","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU1","trainable":true},"inbound_nodes":[[["conv1d_Conv1D1",0,0,{}]]]},{"name":"conv1d_Conv1D2","class_name":"Conv1D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8],"strides":[2],"padding":"same","dilation_rate":[1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D2","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU1",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU2","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU2","trainable":true},"inbound_nodes":[[["conv1d_Conv1D2",0,0,{}]]]},{"name":"conv1d_Conv1D3","class_name":"Conv1D","config":{"filters":48,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8],"strides":[2],"padding":"same","dilation_rate":[1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D3","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU2",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU3","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU3","trainable":true},"inbound_nodes":[[["conv1d_Conv1D3",0,0,{}]]]},{"name":"conv1d_Conv1D4","class_name":"Conv1D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8],"strides":[2],"padding":"same","dilation_rate":[1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D4","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU3",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU4","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU4","trainable":true},"inbound_nodes":[[["conv1d_Conv1D4",0,0,{}]]]},{"name":"conv1d_Conv1D5","class_name":"Conv1D","config":{"filters":96,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D5","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU4",0,0,{}]]]},{"name":"dropout_Dropout1","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true},"inbound_nodes":[[["conv1d_Conv1D5",0,0,{}]]]},{"name":"sub_pixel1d_SubPixel1D1","class_name":"SubPixel1D","config":{"name":"sub_pixel1d_SubPixel1D1","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}]]]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["sub_pixel1d_SubPixel1D1",0,0,{}],["leaky_re_lu_LeakyReLU3",0,0,{}]]]},{"name":"conv1d_Conv1D6","class_name":"Conv1D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D6","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"dropout_Dropout2","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true},"inbound_nodes":[[["conv1d_Conv1D6",0,0,{}]]]},{"name":"sub_pixel1d_SubPixel1D2","class_name":"SubPixel1D","config":{"name":"sub_pixel1d_SubPixel1D2","trainable":true},"inbound_nodes":[[["dropout_Dropout2",0,0,{}]]]},{"name":"concatenate_Concatenate2","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate2","trainable":true},"inbound_nodes":[[["sub_pixel1d_SubPixel1D2",0,0,{}],["leaky_re_lu_LeakyReLU2",0,0,{}]]]},{"name":"conv1d_Conv1D7","class_name":"Conv1D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D7","trainable":true},"inbound_nodes":[[["concatenate_Concatenate2",0,0,{}]]]},{"name":"dropout_Dropout3","class_name":"Dropout","config":{"rate":null,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true},"inbound_nodes":[[["conv1d_Conv1D7",0,0,{}]]]},{"name":"sub_pixel1d_SubPixel1D3","class_name":"SubPixel1D","config":{"name":"sub_pixel1d_SubPixel1D3","trainable":true},"inbound_nodes":[[["dropout_Dropout3",0,0,{}]]]},{"name":"concatenate_Concatenate3","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate3","trainable":true},"inbound_nodes":[[["sub_pixel1d_SubPixel1D3",0,0,{}],["leaky_re_lu_LeakyReLU1",0,0,{}]]]},{"name":"conv1d_Conv1D8","class_name":"Conv1D","config":{"filters":2,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[4],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D8","trainable":true},"inbound_nodes":[[["concatenate_Concatenate3",0,0,{}]]]},{"name":"sub_pixel1d_SubPixel1D4","class_name":"SubPixel1D","config":{"name":"sub_pixel1d_SubPixel1D4","trainable":true},"inbound_nodes":[[["conv1d_Conv1D8",0,0,{}]]]},{"name":"add_Add1","class_name":"Add","config":{"name":"add_Add1","trainable":true},"inbound_nodes":[[["sub_pixel1d_SubPixel1D4",0,0,{}],["input1",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["add_Add1",0,0]]},"keras_version":"tfjs-layers 0.7.4","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv1d_Conv1D1/kernel","shape":[8,1,32],"dtype":"float32"},{"name":"conv1d_Conv1D1/bias","shape":[32],"dtype":"float32"},{"name":"conv1d_Conv1D2/kernel","shape":[8,32,32],"dtype":"float32"},{"name":"conv1d_Conv1D2/bias","shape":[32],"dtype":"float32"},{"name":"conv1d_Conv1D3/kernel","shape":[8,32,48],"dtype":"float32"},{"name":"conv1d_Conv1D3/bias","shape":[48],"dtype":"float32"},{"name":"conv1d_Conv1D4/kernel","shape":[8,48,64],"dtype":"float32"},{"name":"conv1d_Conv1D4/bias","shape":[64],"dtype":"float32"},{"name":"conv1d_Conv1D5/kernel","shape":[8,64,96],"dtype":"float32"},{"name":"conv1d_Conv1D5/bias","shape":[96],"dtype":"float32"},{"name":"conv1d_Conv1D6/kernel","shape":[8,96,64],"dtype":"float32"},{"name":"conv1d_Conv1D6/bias","shape":[64],"dtype":"float32"},{"name":"conv1d_Conv1D7/kernel","shape":[8,64,64],"dtype":"float32"},{"name":"conv1d_Conv1D7/bias","shape":[64],"dtype":"float32"},{"name":"conv1d_Conv1D8/kernel","shape":[4,64,2],"dtype":"float32"},{"name":"conv1d_Conv1D8/bias","shape":[2],"dtype":"float32"}]}]}