{"modelTopology": {"training_config": {"metrics": ["sum_loss", "SNR"], "loss": "mse", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false, "lr": 0.0010000000474974513}}, "sample_weight_mode": null, "loss_weights": null}, "keras_version": "2.2.0", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 64, 1], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv1D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "conv1d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [8]}, "name": "conv1d_1"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_1"}, "name": "leaky_re_lu_1"}, {"class_name": "Conv1D", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "conv1d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [8]}, "name": "conv1d_2"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_2"}, "name": "leaky_re_lu_2"}, {"class_name": "Conv1D", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "conv1d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2], "dilation_rate": [1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [8]}, "name": "conv1d_3"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_3"}, "name": "leaky_re_lu_3"}, {"class_name": "Conv1D", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "conv1d_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2], "dilation_rate": [1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [8]}, "name": "conv1d_4"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_4", 0, 0, {}]]], "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_4"}, "name": "leaky_re_lu_4"}, {"class_name": "Conv1D", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv1d_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "name": "conv1d_5"}, {"class_name": "Lambda", "inbound_nodes": [[["conv1d_5", 0, 0, {}]]], "config": {"function": ["YwEAAAACAAAAAwAAABMAAABzEwAAAIgAAHwAAIgBAIMCAH0BAHwBAFMoAQAAAE4oAAAAACgCAAAA\ndAEAAAB4dAsAAAB4X3Vwc2FtcGxlZCgCAAAAdAwAAABfcGhhc2Vfc2hpZnR0AQAAAHIoAAAAAHM0\nAAAAL3Jvb3QvRmluYWxUZXJtL0Zhc3QtQXVkaW8tU3VwZXItUmVzb2x1dGlvbi9tb2RlbC5weXQI\nAAAAc3VicGl4ZWwbAAAAcwQAAAAAAg8B\n", null, ["_phase_shift", 2]], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": ["YwEAAAADAAAABQAAABMAAABzOQAAAHwAAGQBABl8AABkAgAZiAAAFHQAAHwAAGQDABmIAAAVgwEA\nZwMAfQEAdAEAfAEAgwEAfQIAfAIAUygEAAAATmkAAAAAaQEAAABpAgAAACgCAAAAdAMAAABpbnR0\nBQAAAHR1cGxlKAMAAAB0CwAAAGlucHV0X3NoYXBldAQAAABkaW1zdAwAAABvdXRwdXRfc2hhcGUo\nAQAAAHQBAAAAcigAAAAAczQAAAAvcm9vdC9GaW5hbFRlcm0vRmFzdC1BdWRpby1TdXBlci1SZXNv\nbHV0aW9uL21vZGVsLnB5dA4AAABzdWJwaXhlbF9zaGFwZRQAAABzCgAAAAABBwELARcBDAE=\n", null, [2]], "output_shape_type": "lambda"}, "name": "lambda_1"}, {"class_name": "Lambda", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"function": ["YwEAAAABAAAABAAAAEMAAABzGgAAAHwAAGQAAGQAAIUCAGQBAGQCAIUCAGYCABlTKAMAAABOaRwA\nAABpJAAAACgAAAAAKAEAAAB0AQAAAHgoAAAAACgAAAAAczQAAAAvcm9vdC9GaW5hbFRlcm0vRmFz\ndC1BdWRpby1TdXBlci1SZXNvbHV0aW9uL21vZGVsLnB5dAUAAABzcGxpdAkAAABzAgAAAAAB\n", null, null], "name": "lambda_2", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "name": "lambda_2"}, {"class_name": "Reshape", "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "config": {"target_shape": [8], "trainable": true, "name": "reshape_2"}, "name": "reshape_2"}, {"class_name": "Reshape", "inbound_nodes": [[["lambda_2", 0, 0, {}]]], "config": {"target_shape": [8], "trainable": true, "name": "reshape_1"}, "name": "reshape_1"}, {"class_name": "Add", "inbound_nodes": [[["reshape_2", 0, 0, {}], ["reshape_1", 0, 0, {}]]], "config": {"trainable": true, "name": "add_1"}, "name": "add_1"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["add_1", 0, 0]]}}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [8, 1, 32], "name": "conv1d_1/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv1d_1/bias"}, {"dtype": "float32", "shape": [8, 32, 32], "name": "conv1d_2/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv1d_2/bias"}, {"dtype": "float32", "shape": [8, 32, 64], "name": "conv1d_3/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv1d_3/bias"}, {"dtype": "float32", "shape": [8, 64, 96], "name": "conv1d_4/kernel"}, {"dtype": "float32", "shape": [96], "name": "conv1d_4/bias"}, {"dtype": "float32", "shape": [3, 96, 2], "name": "conv1d_5/kernel"}, {"dtype": "float32", "shape": [2], "name": "conv1d_5/bias"}]}]}
